docs/gui.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-01 Mon 10:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Gui - launch gui</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pradyumna Paranjape" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Gui - launch gui</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2707a2b">Description</a></li>
<li><a href="#orga57b038">Code</a>
<ul>
<li><a href="#orgfb1acc3">Handle global variables and exits</a></li>
<li><a href="#orgd218afb">Parse command</a></li>
<li><a href="#org005a6d8">Launch</a></li>
<li><a href="#org0dc9aaf">Main routine call</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2707a2b" class="outline-2">
<h2 id="org2707a2b">Description</h2>
<div class="outline-text-2" id="text-org2707a2b">
<ul class="org-ul">
<li>Launch gui apps from command line and kill terminal.</li>
<li>TODO: Grab ui properties of the launching frame to launch <b>this</b> app</li>
</ul>
</div>
</div>

<div id="outline-container-orga57b038" class="outline-2">
<h2 id="orga57b038">Code</h2>
<div class="outline-text-2" id="text-orga57b038">
<p>
This section tangles the code (POSIX)
</p>
</div>
<div id="outline-container-orgfb1acc3" class="outline-3">
<h3 id="orgfb1acc3">Handle global variables and exits</h3>
<div class="outline-text-3" id="text-orgfb1acc3">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">set_vars</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #ffffaf;">call</span>=
    <span style="color: #ffffaf;">cmd</span>=
    <span style="color: #ffffaf;">usage</span>=<span style="color: #98be65;">"</span>
<span style="color: #98be65;">     usage: ${0} -h</span>
<span style="color: #98be65;">     usage: ${0} --help</span>
<span style="color: #98be65;">     usage: ${0} [--] CMD</span>
<span style="color: #98be65;">"</span>

    <span style="color: #ffffaf;">help_msg</span>=<span style="color: #98be65;">"${usage}</span>

<span style="color: #98be65;">     DESCRIPTION: |</span>
<span style="color: #98be65;">       Launch CMD, switch to it, and exit the parent terminal</span>

<span style="color: #98be65;">     Optional arguments: |</span>
<span style="color: #98be65;">       -h\tprint usage message and exit</span>
<span style="color: #98be65;">       --help\tprint this help message and exit</span>
<span style="color: #98be65;">       --\tEnd of ${0}'s arguments; necessary if CMD has arguments</span>

<span style="color: #98be65;">     Positional argument: |</span>
<span style="color: #98be65;">       CMD\tCommand to launch</span>
<span style="color: #98be65;">"</span>
<span style="color: #51afef;">}</span>

<span style="color: #9f5f9f; font-weight: bold;">unset_vars</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #d76f10;">unset</span> help_msg
    <span style="color: #d76f10;">unset</span> usage
    <span style="color: #d76f10;">unset</span> cmd
    <span style="color: #d76f10;">unset</span> call
<span style="color: #51afef;">}</span>


<span style="color: #9f5f9f; font-weight: bold;">clean_exit</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    unset_vars
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -n <span style="color: #98be65;">"${1}"</span> <span style="color: #c678dd;">]</span> &amp;&amp; <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"${1}"</span> -ne <span style="color: #98be65;">"0"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -n <span style="color: #98be65;">"${2}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
            <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck disable=SC2059</span>
            printf <span style="color: #98be65;">"${2}\n"</span> &gt;&amp;<span style="color: #da8548; font-weight: bold;">2</span>
        <span style="color: #51afef;">fi</span>
        <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck disable=SC2086</span>
        <span style="color: #51afef;">exit</span> $<span style="color: #c678dd;">{</span><span style="color: #da8548; font-weight: bold;">1</span><span style="color: #c678dd;">}</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -n <span style="color: #98be65;">"${2}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck disable=SC2059</span>
        printf <span style="color: #98be65;">"${2}\n"</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #51afef;">exit</span> <span style="color: #da8548; font-weight: bold;">0</span>
<span style="color: #51afef;">}</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-orgd218afb" class="outline-3">
<h3 id="orgd218afb">Parse command</h3>
<div class="outline-text-3" id="text-orgd218afb">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">cli</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">while</span> <span style="color: #c678dd;">[</span> $<span style="color: #ffffaf;">#</span> -gt <span style="color: #da8548; font-weight: bold;">0</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">do</span>
        <span style="color: #51afef;">case</span> <span style="color: #98be65;">"${1}"</span><span style="color: #51afef;"> in</span>
            -h)
                <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck disable=SC2059</span>
                clean_exit <span style="color: #da8548; font-weight: bold;">0</span> <span style="color: #98be65;">"${usage}"</span>
                ;;
            --help)
                <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck disable=SC2059</span>
                clean_exit <span style="color: #da8548; font-weight: bold;">0</span> <span style="color: #98be65;">"${help_msg}"</span>
                ;;
            --)
                <span style="color: #d76f10;">shift</span> <span style="color: #da8548; font-weight: bold;">1</span>;
                <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">end of gui arguments</span>
                <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -n <span style="color: #98be65;">"${cmd}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
                    <span style="color: #ffffaf;">cmd</span>=<span style="color: #98be65;">"${cmd} $*"</span>
                <span style="color: #51afef;">else</span>
                    <span style="color: #ffffaf;">cmd</span>=<span style="color: #98be65;">"$*"</span>
                <span style="color: #51afef;">fi</span>
                <span style="color: #51afef;">break</span>
                ;;
            *)
                <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">assume gui argument</span>
                <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -n <span style="color: #98be65;">"${cmd}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
                    <span style="color: #ffffaf;">cmd</span>=<span style="color: #98be65;">"${cmd} ${1}"</span>
                    <span style="color: #d76f10;">shift</span> <span style="color: #da8548; font-weight: bold;">1</span>;
                <span style="color: #51afef;">else</span>
                    <span style="color: #ffffaf;">cmd</span>=<span style="color: #98be65;">"${1}"</span>
                    <span style="color: #d76f10;">shift</span> <span style="color: #da8548; font-weight: bold;">1</span>;
                <span style="color: #51afef;">fi</span>
                <span style="color: #51afef;">break</span>
                ;;
        <span style="color: #51afef;">esac</span>
    <span style="color: #51afef;">done</span>
<span style="color: #51afef;">}</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org005a6d8" class="outline-3">
<h3 id="org005a6d8">Launch</h3>
<div class="outline-text-3" id="text-org005a6d8">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">launch_gui</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #ffffaf;">call</span>=<span style="color: #98be65;">"$(echo "${cmd}" | cut -d " " -f 1)"</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -z <span style="color: #98be65;">"${call}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        printf <span style="color: #98be65;">"%s"</span> <span style="color: #98be65;">"${usage}"</span>
        clean_exit <span style="color: #da8548; font-weight: bold;">1</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #51afef;">if</span> <span style="color: #51afef; font-weight: bold;">!</span> command -v <span style="color: #98be65;">"${call}"</span> &gt;/dev/null <span style="color: #da8548; font-weight: bold;">2</span>&gt;&amp;<span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #51afef;">then</span>
        clean_exit <span style="color: #da8548; font-weight: bold;">127</span> <span style="color: #98be65;">"${call} not found..."</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #d76f10;">unset</span> cmd_help
    <span style="color: #d76f10;">unset</span> usage
    <span style="color: #d76f10;">unset</span> call
    nohup <span style="color: #98be65;">"${cmd}"</span> &gt;/dev/null <span style="color: #da8548; font-weight: bold;">0</span>&lt;&amp;- <span style="color: #da8548; font-weight: bold;">2</span>&gt;&amp;<span style="color: #da8548; font-weight: bold;">1</span> &amp; <span style="color: #51afef;">exit</span> <span style="color: #da8548; font-weight: bold;">0</span>
<span style="color: #51afef;">}</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-org0dc9aaf" class="outline-3">
<h3 id="org0dc9aaf">Main routine call</h3>
<div class="outline-text-3" id="text-org0dc9aaf">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">main</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">Main routine call</span>
    set_vars
    cli <span style="color: #98be65;">"$@"</span>
    launch_gui
    clean_exit
<span style="color: #51afef;">}</span>


main <span style="color: #98be65;">"$@"</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
